pabigot/bspacm/examples/nrf51/sht21/main.c
/* BSPACM - nRF51 i2c stuff
 *
 * Written in 2014 by Peter A. Bigot <http://pabigot.github.io/bspacm/>
 *
 * To the extent possible under law, the author(s) have dedicated all
 * copyright and related and neighboring rights to this software to
 * the public domain worldwide. This software is distributed without
 * any warranty.
 *
 * You should have received a copy of the CC0 Public Domain Dedication
 * along with this software. If not, see
 * <http://creativecommons.org/publicdomain/zero/1.0/>.
 */

#include <bspacm/utility/led.h>
#include <bspacm/newlib/ioctl.h>
#include <bspacm/utility/misc.h>
#include <stdio.h>
#include <fcntl.h>
#include <limits.h>
#include <inttypes.h>
#include <string.h>
#include "nrf_delay.h"

#define PIN_SDA 25
#define PIN_SCL 24

#define BIT_SDA (1UL << PIN_SDA)
#define BIT_SCL (1UL << PIN_SCL)

#define SHT21_ADDRESS 0x40

/* These constants define the bits for componentized basic 8-bit
 * commands described in the data sheet. */
#define SHT21_CMDBIT_BASE 0xE0
#define SHT21_CMDBIT_READ 0x01
#define SHT21_CMDBIT_TEMP 0x02
#define SHT21_CMDBIT_RH 0x04
#define SHT21_CMDBIT_UR 0x06
#define SHT21_CMDBIT_NOHOLD 0x10

#define SHT21_TRIGGER_T_HM (SHT21_CMDBIT_BASE | SHT21_CMDBIT_TEMP | SHT21_CMDBIT_READ)
#define SHT21_TRIGGER_RH_HM (SHT21_CMDBIT_BASE | SHT21_CMDBIT_RH | SHT21_CMDBIT_READ)

const uint32_t UPTIME_Hz = 32768;
NRF_RTC_Type * const uptime_rtc = NRF_RTC0;
const int uptime_ccidx_1Hz = 0;
const int uptime_ccidx_alarm = 1;

volatile uint32_t uptime_s;
volatile uint32_t rtc_overflows;
uint32_t rtc_now_last_overflow_;

inline uint64_t rtc_now ()
{
  uint32_t prev_ofl;
  uint32_t ctr24;

  /* Get a consistent pair of counter and overflow values */
  do {
    prev_ofl = rtc_now_last_overflow_;
    ctr24 = uptime_rtc->COUNTER;
    rtc_now_last_overflow_ = rtc_overflows;
  } while (prev_ofl != rtc_now_last_overflow_);
  return (((uint64_t)rtc_now_last_overflow_) << 24) | ctr24;
}

typedef struct uptime_alarm {
  struct uptime_alarm * next;   /** Next alarm to schedule, or NULL to terminate alarm sequence */
  uint32_t delta_utt;           /** Ticks until next alarm should go off */
} uptime_alarm;

/** Pending alarm */
const uptime_alarm * volatile uptime_alarms_;
/** Last alarm to fire */
const uptime_alarm * volatile uptime_alarm_;

/* Return a pointer to the last alarm that fired, or a null pointer if
 * no alarm has fired since the last call to this function. */
const uptime_alarm * uptime_get_alarm ()
{
  BSPACM_CORE_SAVED_INTERRUPT_STATE(istate);
  const uptime_alarm * rv;

  BSPACM_CORE_DISABLE_INTERRUPT();
  do {
    rv = uptime_alarm_;
    uptime_alarm_ = NULL;
  } while (0);
  BSPACM_CORE_REENABLE_INTERRUPT(istate);
  return rv;
}

/** Register a sequence of alarms with the first scheduled at @p
 * alarm_time_utt.  Pass a null pointer as @p sp to disable existing
 * alarms. */
void uptime_set_alarms (const uptime_alarm * sp,
                        uint32_t alarm_time_utt)
{
  BSPACM_CORE_SAVED_INTERRUPT_STATE(istate);

  BSPACM_CORE_DISABLE_INTERRUPT();
  do {
    uptime_alarms_ = sp;
    if (uptime_alarms_) {
      uptime_rtc->CC[uptime_ccidx_alarm] = alarm_time_utt;
      uptime_rtc->INTENSET = (RTC_INTENSET_COMPARE0_Enabled << (RTC_INTENSET_COMPARE0_Pos + uptime_ccidx_alarm));
    } else {
      uptime_rtc->INTENCLR = (RTC_INTENSET_COMPARE0_Enabled << (RTC_INTENSET_COMPARE0_Pos + uptime_ccidx_alarm));
    }
    uptime_alarm_ = NULL;
    uptime_rtc->EVENTS_COMPARE[uptime_ccidx_alarm] = 0;
  } while (0);
  BSPACM_CORE_REENABLE_INTERRUPT(istate);
}

void RTC0_IRQHandler ()
{
  if (uptime_rtc->EVENTS_OVRFLW) {
    uptime_rtc->EVENTS_OVRFLW = 0;
    ++rtc_overflows;
  }
  if (uptime_rtc->EVENTS_COMPARE[uptime_ccidx_1Hz]) {
    uptime_rtc->EVENTS_COMPARE[uptime_ccidx_1Hz] = 0;
    uptime_rtc->CC[uptime_ccidx_1Hz] += UPTIME_Hz;
    ++uptime_s;
  }
  if (uptime_rtc->EVENTS_COMPARE[uptime_ccidx_alarm]) {
    uptime_rtc->EVENTS_COMPARE[uptime_ccidx_alarm] = 0;
    if (uptime_alarms_) {
      uptime_alarm_ = uptime_alarms_;
      uptime_alarms_ = uptime_alarm_->next;
    }
    if (uptime_alarm_) {
      uptime_rtc->CC[uptime_ccidx_alarm] += uptime_alarm_->delta_utt;
    } else {
      uptime_rtc->INTENCLR = (RTC_INTENSET_COMPARE0_Enabled << (RTC_INTENSET_COMPARE0_Pos + uptime_ccidx_alarm));
    }
  }
}

/* TWI bus error returns are negative integers with absolute value
 * taken from the ERRORSRC register augmented by several flags for
 * other error conditions. */

#define TWI_BUS_ERROR_PAN_56 0x100
#define TWI_BUS_ERROR_CLEAR_FAILED 0x200
#define TWI_BUS_ERROR_UNKNOWN 0x400

#ifndef ENABLE_PAN_36
/** PAN-36: Shortcuts are not functional
 * Use PPI channel to enforce BB to SUSPEND and STOP tasks */
#define ENABLE_PAN_36 1
#endif /* ENABLE_PAN_36 */

#ifndef ENABLE_PAN_56
/** PAN-56: module lock-up
 *
 * Various conditions require a full power-cycle of the TWI module to
 * restore functionality.  The likelihood of occurrence can be
 * lessened by certain behaviors, but in the end we need to alarm if
 * an expected RXDREADY or TXDREADY signal is not received in a timely
 * manner. */
#define ENABLE_PAN_56 1
#endif /* ENABLE_PAN_56 */

typedef struct twi_periphs_type {
  NRF_TWI_Type * twi;
#if (ENABLE_PAN_36 - 0)
  NRF_PPI_Type * ppi;
  unsigned int chidx;
#endif /* ENABLE_PAN_36 */
#if (ENABLE_PAN_56 - 0)
  /* If the block for TXDREADY or RXDREADY takes more than this number
   * of iterations then assume the TWI is locked up and power-cycle
   * it.  A value of zero uses a non-zero internal default. */
  unsigned int pan56_loop_limit;

#ifndef DEFAULT_PAN56_LOOP_LIMIT
  /* Default loop limit if pan56_loop_limit is zero.  Ignoring delays
   * due to devices being slow, we need enough TWI clock cycles to
   * process one octet.  Give it a little leeway, too.  Let's do 100
   * SCLK cycles at 100 kHz, or 1 ms, and assume 16 MHz MCU clock and
   * 5 clocks per iteration. */
#define DEFAULT_PAN56_LOOP_LIMIT (16000 / 5)
#endif /* DEFAULT_PAN56_LOOP_LIMIT */

#define PAN56_DECLARE_AND_INITIALIZE(tpp_)       \
  int loop_limit_ = (tpp_)->pan56_loop_limit;    \
  if (0 == loop_limit_) {                        \
    loop_limit_ = DEFAULT_PAN56_LOOP_LIMIT;      \
  } else if (0 > loop_limit_) {                  \
    loop_limit_ = INT_MAX;                       \
  }
#define PAN56_CHECK_EXCEEDED() (0 >= --loop_limit_)
#define PAN56_MAYBE_RETURN_RESET(tpp_) do {     \
    if (0 > loop_limit_) {                      \
      return - (TWI_BUS_ERROR_PAN_56 | - twi_pan56_reset(tpp_)); \
    }                                           \
  } while (0)

