pabigot/bspacm/examples/nrf51/sht21/main.c
#else /* ENABLE_PAN_56 */
#define PAN56_DECLARE_AND_INITIALIZE(tpp_)  do { } while (0)
#define PAN56_CHECK_EXCEEDED() (0)
#define PAN56_MAYBE_RETURN_RESET(tpp_) do { } while (0)
#endif /* ENABLE_PAN_56 */
} twi_periphs_type;

/** Reset the I2C bus to idle state if a secondary device is holding
 * it active.
 *
 * The return value is zero if bus is left in the idle state (SDA and
 * SCL not pulled low), and #TWI_BUS_ERROR_CLEAR_FAILED if not. */
int twi_bus_clear (const twi_periphs_type * tpp)
{
  const uint32_t pin_cnf = (0
    | (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
    | (GPIO_PIN_CNF_DRIVE_S0D1 << GPIO_PIN_CNF_DRIVE_Pos)
    | (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos)
    | (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos)
    | (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos)
    );
  int pin_scl = 0x1f & tpp->twi->PSELSCL;
  int pin_sda = 0x1f & tpp->twi->PSELSDA;
  uint32_t const bit_scl = (1U << pin_scl);
  uint32_t const bit_sda = (1U << pin_sda);
  uint32_t const bits = bit_scl | bit_sda;
  uint32_t pin_cnf_scl = NRF_GPIO->PIN_CNF[pin_scl];
  uint32_t pin_cnf_sda = NRF_GPIO->PIN_CNF[pin_sda];
  uint32_t enable = tpp->twi->ENABLE;
  unsigned int const half_cycle_us = 5; /* Half cycle at 100 kHz */
  bool cleared;

  /* Pull up SDA and SCL then turn off TWI and wait a cycle to
   * settle before sampling the signals. */
  NRF_GPIO->PIN_CNF[pin_scl] = pin_cnf;
  NRF_GPIO->PIN_CNF[pin_sda] = pin_cnf;
  NRF_GPIO->OUTSET = bits;
  tpp->twi->ENABLE = 0;
  nrf_delay_us(2 * half_cycle_us);
  cleared = (bits == (bits & NRF_GPIO->IN));

  if (! cleared) {
    /* At least one of SDA or SCL is being held low by a follower
     * device.  Toggle the clock enough to flush both leader and
     * follower bytes, then see if it's let go. */
    int cycles = 18;
    while (0 < cycles--) {
      NRF_GPIO->OUTCLR = bit_scl;
      nrf_delay_us(half_cycle_us);
      NRF_GPIO->OUTSET = bit_scl;
      nrf_delay_us(half_cycle_us);
    }
    cleared = (bits == (bits & NRF_GPIO->IN));
  }

  /* Put the pins back to inputs and restore the TWI peripheral. */
  NRF_GPIO->PIN_CNF[pin_sda] = pin_cnf_sda;
  NRF_GPIO->PIN_CNF[pin_scl] = pin_cnf_scl;
  tpp->twi->ENABLE = enable;

  /* Return success if the bus is cleared. */
  return cleared ? 0 : TWI_BUS_ERROR_CLEAR_FAILED;
}

/** Invoked when a read or write operation detects a bus error.
 *
 * The error cause(s) are read and returned as a bit set.  If no error
 * is detected, #TWI_BUS_ERROR_UNKNOWN is set.  An attempt is made to
 * restore the bus to a cleared state; failure to do so is also
 * indicated in the return value.
 *
 * The return value will always be a positive integer representing one
 * or more error flags. */
int twi_error_clear (const twi_periphs_type * tpp)
{
  int rv = tpp->twi->ERRORSRC;
  if (0 == rv) {
    rv |= TWI_BUS_ERROR_UNKNOWN;
  }
  tpp->twi->ERRORSRC = 0;
  rv |= twi_bus_clear(tpp);
  return rv;
}

/** Configure and enable the TWI peripheral.
 *
 * @param pin_scl the pin to use as the serial clock signal.  nRF51
 * default is 24.
 *
 * @param pin_sda the pin to use as the serial data signal.  nRF51
 * default is 25.
 *
 * @param frequency the setting for the peripheral FREQUENCY register.
 * For example, #TWI_FREQUENCY_FREQUENCY_K400.
 *
 * @return Zero if configuration was successful, otherwise a negative
 * error code. */
int twi_initialize (const twi_periphs_type * tpp,
                    int pin_scl,
                    int pin_sda,
                    uint32_t frequency)
{
  const uint32_t pin_cnf = (0
    | (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
    | (GPIO_PIN_CNF_DRIVE_S0D1 << GPIO_PIN_CNF_DRIVE_Pos)
    | (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos)
    | (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos)
    | (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos)
    );

  NRF_GPIO->PIN_CNF[pin_scl] = pin_cnf;
  NRF_GPIO->PIN_CNF[pin_sda] = pin_cnf;

  tpp->twi->EVENTS_RXDREADY = 0;
  tpp->twi->EVENTS_TXDSENT = 0;
  tpp->twi->PSELSCL = pin_scl;
  tpp->twi->PSELSDA = pin_sda;
  tpp->twi->FREQUENCY = frequency;

#if (ENABLE_PAN_36 - 0)
  tpp->ppi->CHENCLR = PPI_CHENCLR_CH0_Msk << tpp->chidx;
#endif /* ENABLE_PAN_36 */

  tpp->twi->ENABLE = (TWI_ENABLE_ENABLE_Enabled << TWI_ENABLE_ENABLE_Pos);

  return - twi_bus_clear(tpp);
}

/** Power cycle the peripheral and re-initialize it.
 *
 * Returns zero if the reset was successful, otherwise a negative error code. */
int twi_pan56_reset (const twi_periphs_type * tpp)
{
  uint32_t pin_scl = tpp->twi->PSELSCL;
  uint32_t pin_sda = tpp->twi->PSELSDA;
  uint32_t frequency = tpp->twi->FREQUENCY;
  uint16_t address = tpp->twi->ADDRESS;
  int rv;

  printf("PAN56 Workaround!\n");
  ((twi_periphs_type*)tpp)->pan56_loop_limit = 0;
  tpp->twi->ENABLE = (TWI_ENABLE_ENABLE_Disabled << TWI_ENABLE_ENABLE_Pos);
  tpp->twi->POWER = 0;
  nrf_delay_us(5);
  tpp->twi->POWER = 1;
  rv = twi_initialize(tpp, pin_scl, pin_sda, frequency);
  if (0 == rv) {
    tpp->twi->ADDRESS = address;
  }
  return rv;
}

int twi_read (const twi_periphs_type * tpp,
              uint8_t * dp,
              size_t len)
{
  uint8_t * const dps = dp;
  uint8_t * const dpe = dps + len;
  int rv = len;

/* The nRF51 RM demonstrates BB->SUSPEND and BB->STOP connections
 * during TWI reads, but fails to motivate this except for the
 * BB->STOP required for the last byte read.  A compelling discusion
 * of why the non-final byte connections are also needed is at:
 * https://devzone.nordicsemi.com/question/17472
 *
 * Select the appropriate mechanism to provide this coordination. */
#if (ENABLE_PAN_36 - 0)
  tpp->ppi->CH[tpp->chidx].EEP = (uintptr_t)&tpp->twi->EVENTS_BB;
  if (1 == len) {
    tpp->ppi->CH[tpp->chidx].TEP = (uintptr_t)&tpp->twi->TASKS_STOP;
  } else {
    tpp->ppi->CH[tpp->chidx].TEP = (uintptr_t)&tpp->twi->TASKS_SUSPEND;
  }
  tpp->ppi->CHENSET = PPI_CHENSET_CH0_Msk;
#else /* */
  if (1 == len) {
    tpp->twi->SHORTS = (TWI_SHORTS_BB_STOP_Enabled << TWI_SHORTS_BB_STOP_Pos);
  } else {
    tpp->twi->SHORTS = (TWI_SHORTS_BB_SUSPEND_Enabled << TWI_SHORTS_BB_SUSPEND_Pos);
  }
#endif /* ENABLE_PAN_36 */

  PAN56_DECLARE_AND_INITIALIZE(tpp);
  tpp->twi->EVENTS_ERROR = 0;
  tpp->twi->EVENTS_STOPPED = 0;
  tpp->twi->EVENTS_RXDREADY = 0;
  tpp->twi->TASKS_STARTRX = 1;
  while (dp < dpe) {
    while (! (tpp->twi->EVENTS_RXDREADY
              || PAN56_CHECK_EXCEEDED()
              || tpp->twi->EVENTS_ERROR)) {
    }
    PAN56_MAYBE_RETURN_RESET(tpp);
    if (tpp->twi->EVENTS_ERROR) {
      tpp->twi->EVENTS_STOPPED = 0;
      tpp->twi->TASKS_STOP = 1;
      rv = -1;
      break;
    }
    if (tpp->twi->EVENTS_RXDREADY) {
      *dp++ = tpp->twi->RXD;
      if ((dp+1) >= dpe) {
#if (ENABLE_PAN_36 - 0)
        tpp->ppi->CH[tpp->chidx].TEP = (uintptr_t)&tpp->twi->TASKS_STOP;
#else /* ENABLE_PAN_36 */
        tpp->twi->SHORTS = (TWI_SHORTS_BB_STOP_Enabled << TWI_SHORTS_BB_STOP_Pos);
#endif /* ENABLE_PAN_36 */
      }
      tpp->twi->EVENTS_RXDREADY = 0;
    }
#if (ENABLE_PAN_56 - 0)
    /* PAN-56: module lock-up
     *
     * Delay RESUME for a least two TWI clock periods after RXD read
     * to ensure clock-stretched ACK completes.  100 kHz = 20us, 400 kHz = 5us. */
    nrf_delay_us(20);
#endif /* ENABLE_PAN_56 */
    tpp->twi->TASKS_RESUME = 1;
  }
#if (ENABLE_PAN_36 - 0)
  tpp->ppi->CHENCLR = PPI_CHENCLR_CH0_Msk;
#else /* ENABLE_PAN_36 */
  tpp->twi->SHORTS = 0;
#endif /* ENABLE_PAN_36 */
  while (! tpp->twi->EVENTS_STOPPED) {
  }
  tpp->twi->EVENTS_STOPPED = 0;
  if (0 > rv) {
    rv = twi_error_clear(tpp);
  }
  return rv;
}

