pabigot/bspacm/examples/nrf51/sht21/main.c
int twi_write (const twi_periphs_type * tpp,
               const uint8_t * sp,
               size_t len)
{
  const uint8_t * const spe = sp + len;
  int rv = len;

  tpp->twi->EVENTS_ERROR = 0;
  tpp->twi->EVENTS_TXDSENT = 0;
  tpp->twi->TXD = *sp;
  tpp->twi->TASKS_STARTTX = 1;

  PAN56_DECLARE_AND_INITIALIZE(tpp);
  while (true) {
    while (! (tpp->twi->EVENTS_TXDSENT
              || PAN56_CHECK_EXCEEDED()
              || tpp->twi->EVENTS_ERROR)) {
    }
    PAN56_MAYBE_RETURN_RESET(tpp);
    if (tpp->twi->EVENTS_ERROR) {
      rv = -1;
      break;
    }
    if (tpp->twi->EVENTS_TXDSENT) {
      tpp->twi->EVENTS_TXDSENT = 0;
      if (++sp < spe) {
        tpp->twi->TXD = *sp;
      } else {
        break;
      }
    }
  }
  tpp->twi->EVENTS_STOPPED = 0;
  tpp->twi->TASKS_STOP = 1;
  while (! tpp->twi->EVENTS_STOPPED) {
  }
  tpp->twi->EVENTS_STOPPED = 0;
  if (0 > rv) {
    rv = twi_error_clear(tpp);
  }
  return rv;
}

int sht21_crc (const uint8_t * data,
               int len)
{
  static const uint16_t SHT_CRC_POLY = 0x131;
  uint8_t crc = 0;

  while (0 < len--) {
    int bi;

    crc ^= *data++;
    for (bi = 8; bi > 0; --bi) {
      if (crc & 0x80) {
        crc = (crc << 1) ^ SHT_CRC_POLY;
      } else {
        crc <<= 1;
      }
    }
  }
  return crc;
}

int sht21_read_eic (const twi_periphs_type * tp,
                    uint8_t * eic)
{
  uint8_t data[16];
  uint8_t * dp;
  int rc;

  dp = data;
  *dp++ = 0xFA;
  *dp++ = 0x0F;
  rc = twi_write(tp, data, dp-data);
  if (0 <= rc) {
    rc = twi_read(tp, data, 8);
  }
  if (0 <= rc) {
    if ((0 == sht21_crc(data+0, 2))
        && (0 == sht21_crc(data+2, 2))
        && (0 == sht21_crc(data+4, 2))
        && (0 == sht21_crc(data+6, 2))) {
      eic[2] = data[0];
      eic[3] = data[2];
      eic[4] = data[4];
      eic[5] = data[6];
      dp = data;
      *dp++ = 0xFC;
      *dp++ = 0xC9;
      rc = twi_write(tp, data, dp-data);
    } else {
      rc = -1;
    }
  }
  if (0 <= rc) {
    rc = twi_read(tp, data, 6);
  }
  if (0 <= rc) {
    if ((0 == sht21_crc(data+0, 3))
        && (0 == sht21_crc(data+3, 3))) {
      eic[0] = data[3];
      eic[1] = data[4];
      eic[6] = data[0];
      eic[7] = data[1];
      rc = 8;
    } else {
      rc = -1;
    }
  }
  printf("eic ret %d\n", rc);
  return rc;
}

typedef struct alarm_stage {
  uptime_alarm alarm;
  int (* callback) (struct alarm_stage * asp);
  const twi_periphs_type * tpp;
  uint8_t cmd;
} alarm_stage;

unsigned int wake_count;
uint64_t epoch;
uint64_t wake_total;
uint16_t t_raw;
uint16_t rh_raw;

/** Convert a raw humidity value to parts-per-thousand as an unsigned
 * int */
/* RH_pph = -6 + 125 * S / 2^16 */
#define BSP430_SENSORS_SHT21_HUMIDITY_RAW_TO_ppth(raw_) (unsigned int)(((1250UL * (raw_)) >> 16) - 60)

/** Convert a raw temperature value to centi-degrees Kelvin as an
 * unsigned int */
/* T_dC = -46.85 + 175.72 * S / 2^16
 * T_cK = 27315 - 4685 + 17572 * S / 2^16
 *      = 22630 + 17572 * S / 2^16
 */
#define BSP430_SENSORS_SHT21_TEMPERATURE_RAW_TO_cK(raw_) (22630U + (unsigned int)((17572UL * (raw_)) >> 16))

int show_results (alarm_stage * asp)
{
  uint64_t now = rtc_now();
  uint64_t elapsed = now - epoch;

  (void)asp;

  printf("%lu: %u wakeups ; uptime %lu ; awake %lu ; duty %lu [ppth]\n",
         (unsigned long)(now / UPTIME_Hz),
         wake_count,
         (unsigned long)elapsed,
         (unsigned long)wake_total,
         (unsigned long)((1000 * wake_total) / elapsed));
#if ! (DUTY_CYCLE_ONLY - 0)
  /* If all output is disabled the duty cycle is less than 0.2%, as
   * opposed to 1.5% with output enabled.  This is about 2 ms per
   * measurement. */
  unsigned int t_cK = BSP430_SENSORS_SHT21_TEMPERATURE_RAW_TO_cK(t_raw);
  int t_cCel = t_cK - 27315;
  int t_cFahr = 3200 + (9 * t_cCel) / 5;
  unsigned int rh_ppth = BSP430_SENSORS_SHT21_HUMIDITY_RAW_TO_ppth(rh_raw);
  printf("\tT: %u raw ; %u cK ; %d cCel ; %d c[Fahr]\n", t_raw, t_cK, t_cCel, t_cFahr);
  printf("\tRH: %u raw %u ppth\n", rh_raw, rh_ppth);
  t_raw = rh_raw = ~0;
#endif /* ! DUTY_CYCLE_ONLY */

#if ! (EXCLUDE_DIE_TEMP - 0)
  {
    NRF_TEMP->EVENTS_DATARDY = 0;
    NRF_TEMP->TASKS_START = 1;
    while (! NRF_TEMP->EVENTS_DATARDY) {
    }
    NRF_TEMP->EVENTS_DATARDY = 0;

    /* PAN-29: STOP task clears TEMP register */
    uint32_t dt_raw = NRF_TEMP->TEMP;

    /* PAN-30: TEMP module analog front end does not power down when
     * DATARDY event occurs */
    NRF_TEMP->TASKS_STOP = 1;

    /* PAN-28: Negative measured values are not represented correctly.
     * Sign extension does not go higher than bit 9.
     *
     * Value is 10-bit 2's complement.  Convert to 32-bit 2's
     * complement. */
    const uint32_t sign_bit = 0x0200;
    if (dt_raw & sign_bit) {
      dt_raw |= ~(sign_bit - 1);
    }

    int dt_cCel = 25 * (int)(int32_t)dt_raw;
    int dt_cFahr = (3200 + (9 * dt_cCel) / 5);
    printf("\tT[die]: %d cCel ; %d c[Fahr]\n", dt_cCel, dt_cFahr);
  }
#endif /* EXCLUDE_DIE_TEMP */

  return 0;
}

int send_read (alarm_stage * asp)
{
  uint8_t cmd = (asp->cmd
                 | SHT21_CMDBIT_BASE
                 | SHT21_CMDBIT_READ
                 | SHT21_CMDBIT_NOHOLD);
  return twi_write(asp->tpp, &cmd, sizeof(cmd));
}

int read_result (alarm_stage * asp)
{
  uint8_t data[3];
  int rc;

  rc = twi_read(asp->tpp, data, sizeof(data));
  if ((0 <= rc) && (0 == sht21_crc(data, rc))) {
    rc = ((data[0] << 8) | data[1]) & ~0x03;
    if (asp->cmd) {
      t_raw = rc;
      rc = send_read(asp);
    } else {
      rh_raw = rc;
      show_results(asp);
    }
  }
  return rc;
}

void main ()
{
  twi_periphs_type tp;
  vBSPACMledConfigure();
  BSPACM_CORE_ENABLE_INTERRUPT();

  printf("\n" __DATE__ " " __TIME__ "\n");
  printf("System clock %lu Hz\n", SystemCoreClock);

  printf("Initial stat: HF %08lx LF %08lx src %lu\n",
         NRF_CLOCK->HFCLKSTAT, NRF_CLOCK->LFCLKSTAT, NRF_CLOCK->LFCLKSRC);

  /* LFCLK starts as the RC oscillator.  Start the crystal . */
  NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;
  NRF_CLOCK->LFCLKSRC = (CLOCK_LFCLKSTAT_SRC_Xtal << CLOCK_LFCLKSTAT_SRC_Pos);
  NRF_CLOCK->TASKS_LFCLKSTART = 1;
  while (! NRF_CLOCK->EVENTS_LFCLKSTARTED) {
  }

  printf("Post start stat: HF %08lx LF %08lx src %lu\n",
         NRF_CLOCK->HFCLKSTAT, NRF_CLOCK->LFCLKSTAT, NRF_CLOCK->LFCLKSRC);

  /* RTC only works on LFCLK.  Set one up using a zero prescaler (runs
   * at 32 KiHz).  Clock's 24 bits, so track overflow in a 32-bit
   * external counter, giving us 56 bits for the full clock (span 2^41
   * seconds, roughly 69 thousand years).
   *
   * Also enable a comparison that will fire an event at 1Hz.  We
   * don't use these events in PPI so don't enable event routing; we
   * do need the interrupts, though. */
  uptime_rtc->TASKS_STOP = 1;
  uptime_rtc->TASKS_CLEAR = 1;
  uptime_rtc->EVTENCLR = ~0;
  uptime_rtc->INTENCLR = ~0;
  uptime_rtc->CC[uptime_ccidx_1Hz] = UPTIME_Hz;
  uptime_rtc->INTENSET = ((RTC_INTENSET_OVRFLW_Enabled << RTC_INTENSET_OVRFLW_Pos)
                          | (RTC_INTENSET_COMPARE0_Enabled << (RTC_INTENSET_COMPARE0_Pos + uptime_ccidx_1Hz)));

  NVIC_ClearPendingIRQ(RTC0_IRQn);
  NVIC_EnableIRQ(RTC0_IRQn);

  uptime_rtc->TASKS_START = 1;

  /* PAN-31: Temperature offset value has to be manually loaded.
   * Address is 0x4000C504, the word before TEMP.  The struct does
   * not have a field for this. */
  ((__O uint32_t *)&NRF_TEMP->TEMP)[-1] = 0;

  do {
    alarm_stage alarm_stages[4];
    alarm_stage * asp;
    unsigned int remaining_delay;
    uint8_t buf[16];
    int rc;

    /* Now configure TWI (I2C) for a SHT21 */
    memset(&tp, 0, sizeof(tp));
#if (ENABLE_PAN_36 - 0)
    tp.ppi = NRF_PPI;
    tp.chidx = 0;
#endif /* ENABLE_PAN_36 */
#if (ENABLE_PAN_56 - 0)
    /* 500 is enough for a responsive I2C device at 400 kHz; 800 is
     * enough at 100 kHz.  Use smaller values to verify the reset
     * works. */
    tp.pan56_loop_limit = 800;
#endif /* ENABLE_PAN_56 */
    tp.twi = NRF_TWI0;

    twi_initialize(&tp, PIN_SCL, PIN_SDA, (TWI_FREQUENCY_FREQUENCY_K400 << TWI_FREQUENCY_FREQUENCY_Pos));

