pabigot/bspacm/examples/nrf51/sht21/main.c
    tp.twi->ADDRESS = SHT21_ADDRESS;

    /* Read the EIC */
    rc = sht21_read_eic(&tp, buf);
    printf("EIC %d: ", rc);
    if (0 <= rc) {
      vBSPACMconsoleDisplayOctets(buf, rc);
    }
    putchar('\n');
    if (0 > rc) {
      rc = sht21_read_eic(&tp, buf);
      printf("Retry EIC %d: ", rc);
      if (0 <= rc) {
        vBSPACMconsoleDisplayOctets(buf, rc);
        putchar('\n');
      }
    }

    remaining_delay = UPTIME_Hz;

    memset(alarm_stages, 0, sizeof(alarm_stages));

    asp = alarm_stages;

    asp->callback = send_read;
    asp->tpp = &tp;
    asp->cmd = SHT21_CMDBIT_TEMP;
    /* High-resolution temperature read takes up to 85 ms.  Sleep for
     * 100 ms. */
    asp->alarm.delta_utt = UPTIME_Hz / 10;
    remaining_delay -= asp->alarm.delta_utt;
    asp->alarm.next = &asp[1].alarm;
    ++asp;

    asp->callback = read_result;
    asp->tpp = &tp;
    asp->cmd = SHT21_CMDBIT_RH;
    /* High-resolution humidity read takes up to 29 ms.  Sleep for 50
     * ms. */
    asp->alarm.delta_utt = UPTIME_Hz / 20;
    remaining_delay -= asp->alarm.delta_utt;
    asp->alarm.next = &asp[1].alarm;
    ++asp;

    asp->callback = read_result;
    asp->tpp = &tp;
    asp->alarm.delta_utt = remaining_delay;
    remaining_delay -= asp->alarm.delta_utt;
    asp->alarm.next = &alarm_stages[0].alarm;

    uint64_t last_wake = rtc_now();
    wake_count = 0;
    epoch = last_wake;
    uptime_set_alarms(asp->alarm.next, UPTIME_Hz);
    while (1) {
      const uptime_alarm * ap;
      while (! ((ap = uptime_get_alarm()))) {
        uint64_t last_sleep = rtc_now();
        wake_total += (last_sleep - last_wake);
        __WFE();
        last_wake = rtc_now();
        /* NB: We can get wakeups not only because the alarm is ready
         * but also because of UART interrupts as the transmit buffer
         * drains. */
        ++wake_count;
      }
      asp = (alarm_stage *)ap;
      asp->callback(asp);
    }
  } while (0);
  fflush(stdout);
  ioctl(1, BSPACM_IOCTL_FLUSH, O_WRONLY);
  BSPACM_CORE_DEEP_SLEEP();
}
